Question 1: Pandas Basics
1.1 Importing Pandas
Write the command to import the Pandas library and check its version.
1.2 Creating a DataFrame
Create a simple DataFrame using the following data:
Name Age City
Alice 25 New York
Bob 30 Los Angeles
Charlie 35 Chicago
Print the DataFrame

In [ ]:

import pandas as pd


print("Pandas version:", pd.__version__)

Pandas version: 2.2.2

In [ ]:

data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}


df = pd.DataFrame(data)


print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

Question 2: Pandas Series
2.1 Creating a Series
Create a Pandas Series from the list [100, 200, 300, 400, 500].
Print the Series.
2.2 Accessing Elements in a Series
From the Series created in Question 2.1, access the second and fourth elements and print them.
2.3 Series Operations
Create a second Series S2 with values [10, 20, 30, 40, 50].
Perform element-wise addition between the two Series (S1 from 2.1 and S2) and print the result.

In [ ]:
import pandas as pd


S1 = pd.Series([100, 200, 300, 400, 500])


print("Series S1:")
print(S1)

Series S1:
0    100
1    200
2    300
3    400
4    500
dtype: int64

In [ ]:

elements = S1[[1, 3]]

print("\nSecond and Fourth elements of S1:")
print(elements)

Second and Fourth elements of S1:
1    200
3    400
dtype: int64

In [ ]:

S2 = pd.Series([10, 20, 30, 40, 50])


result = S1 + S2

print("\nElement-wise addition of S1 and S2:")
print(result)

Element-wise addition of S1 and S2:
0    110
1    220
2    330
3    440
4    550
dtype: int64

Question 3: DataFrame Basics
3.1 DataFrame Column Access
Using the DataFrame created in Question 1.2, print only the 'Name' and 'City' columns.
3.2 Adding a New Column
Add a new column Salary to the DataFrame in Question 1.2 with the following values: [50000, 60000,
70000].
Print the updated DataFrame.
3.3 Basic Statistics on DataFrames
Using the updated DataFrame, calculate and print:
 The average Age
 The total sum of Salary

In [ ]:
import pandas as pd


data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}

df = pd.DataFrame(data)

In [ ]:

print("Name and City columns:")
print(df[['Name', 'City']])

Name and City columns:
      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [ ]:

df['Salary'] = [50000, 60000, 70000]

print("\nUpdated DataFrame with Salary:")
print(df)

Updated DataFrame with Salary:
      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [ ]:

avg_age = df['Age'].mean()
print("\nAverage Age:", avg_age)


total_salary = df['Salary'].sum()
print("Total Salary:", total_salary)

Average Age: 30.0
Total Salary: 180000

Question 4: Filtering and Indexing
4.1 Conditional Filtering
Filter the DataFrame from Question 3.2 to display rows where the Age is greater than 28.
Print the filtered DataFrame.
4.2 Setting and Resetting Index
Set the Name column as the index of the DataFrame and print the updated DataFrame.
Then reset the index to the default and print the DataFrame again.

In [ ]:
import pandas as pd


data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"],
    "Salary": [50000, 60000, 70000]
}

df = pd.DataFrame(data)

In [ ]:

filtered_df = df[df['Age'] > 28]

print("Rows where Age > 28:")
print(filtered_df)

Rows where Age > 28:
      Name  Age         City  Salary
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [ ]:

df_indexed = df.set_index('Name')
print("\nDataFrame with 'Name' as index:")
print(df_indexed)


df_reset = df_indexed.reset_index()
print("\nDataFrame after resetting index:")
print(df_reset)

DataFrame with 'Name' as index:
         Age         City  Salary
Name
Alice     25     New York   50000
Bob       30  Los Angeles   60000
Charlie   35      Chicago   70000

DataFrame after resetting index:
      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

Question 7: Merging DataFrames
7.1 Merging Two DataFrames
You are given two DataFrames:
df1 = pd.DataFrame({
 'Name': ['John', 'Jane', 'Emily'],
 'Department': ['Sales', 'Marketing', 'HR']
})
df2 = pd.DataFrame({
 'Name': ['John', 'Jane', 'Emily'],
 'Experience (Years)': [5, 7, 3]
})
Write the code to merge these two DataFrames on the Name column.
Print the merged DataFrame.

In [ ]:
import pandas as pd

df1 = pd.DataFrame({
    'Name': ['John', 'Jane', 'Emily'],
    'Department': ['Sales', 'Marketing', 'HR']
})


df2 = pd.DataFrame({
    'Name': ['John', 'Jane', 'Emily'],
    'Experience (Years)': [5, 7, 3]
})

In [ ]:

merged_df = pd.merge(df1, df2, on='Name')


print("Merged DataFrame:")
print(merged_df)

Merged DataFrame:
    Name Department  Experience (Years)
0   John      Sales                   5
1   Jane  Marketing                   7
2  Emily         HR                   3

Question 8: Sorting
8.1 Sorting Data
Sort the DataFrame from Question 7.1 based on the Experience (Years) column in descending order.
Print the sorted DataFrame.

In [ ]:
import pandas as pd


merged_df = pd.DataFrame({
    'Name': ['John', 'Jane', 'Emily'],
    'Department': ['Sales', 'Marketing', 'HR'],
    'Experience (Years)': [5, 7, 3]
})

In [ ]:

sorted_df = merged_df.sort_values(by='Experience (Years)', ascending=False)


print("DataFrame sorted by Experience (descending):")
print(sorted_df)

DataFrame sorted by Experience (descending):
    Name Department  Experience (Years)
1   Jane  Marketing                   7
0   John      Sales                   5
2  Emily         HR                   3